tutorials/lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/constant/kinematicCloud1Positions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloud1Positions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.0075 0.5 0.05)
(0.0125 0.5 0.05)
(0.0175 0.5 0.05)
(0.0225 0.5 0.05)
(0.0275 0.5 0.05)
(0.0325 0.5 0.05)
(0.0375 0.5 0.05)
(0.0425 0.5 0.05)
(0.0475 0.5 0.05)
(0.0075 0.4 0.05)
(0.0125 0.4 0.05)
(0.0175 0.4 0.05)
(0.0225 0.4 0.05)
(0.0275 0.4 0.05)
(0.0325 0.4 0.05)
(0.0375 0.4 0.05)
(0.0425 0.4 0.05)
(0.0475 0.4 0.05)
)
// ************************************************************************* //
