tutorials/lagrangian/rhoPisoTwinParcelFoam/simplifiedSiwek/constant/thermoCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        U
        {
            semiImplicit    false;
        }
        hs
        {
            semiImplicit    false;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        mu              cell;
        U               cellPoint;
        T               cell;
        Cp              cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Analytical;
    }
}

constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    minParticleMass 1e-15;

    rho0            2500;
    T0              300;
    Cp0             900;

    youngsModulus   1e9;
    poissonsRatio   0.35;

    epsilon0        1;
    f0              0.5;

    Pr              0.7;
}

particleForces
{
    gravity             on;
    virtualMass         off;
    pressureGradient    off;
    paramagnetic        off;
}

subModels
{
    InjectionModel  ManualInjection;

    DragModel       SphereDrag;

    DispersionModel StochasticDispersionRAS;

    PatchInteractionModel StandardWallInteraction;

    HeatTransferModel RanzMarshall;

    PostProcessingModel none;

    CollisionModel none;

    SurfaceFilmModel none;

    radiation       off;

    ManualInjectionCoeffs
    {
        massTotal       0.0001;
        parcelBasisType mass;
        SOI             0;
        positionsFile   "thermoCloud1Positions";
        U0              ( 0 0 0 );
        parcelPDF
        {
            pdfType         RosinRammler;
            RosinRammlerPDF
            {
                minValue        5e-06;
                maxValue        0.0005;
                d               5e-05;
                n               0.5;
            }
        }
    }

    StandardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        // thermal shielding
        BirdCorrection  false;
    }
}


// ************************************************************************* //
